In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../../datasets/gapminder.csv')

In [3]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [5]:
df2 = df[['year','population', 'life_exp']]
df2

      year  population  life_exp
0     1952     8425333    28.801
1     1957     9240934    30.332
2     1962    10267083    31.997
3     1967    11537966    34.020
4     1972    13079460    36.088
...    ...         ...       ...
1699  1987     9216418    62.351
1700  1992    10704340    60.377
1701  1997    11404948    46.809
1702  2002    11926563    39.989
1703  2007    12311143    43.487

[1704 rows x 3 columns]

In [27]:
df2.loc[0:].sum(axis=1)
df2

      year  population  life_exp           sum         total
0     1952     8425333    28.801  8.427314e+06  5.056388e+07
1     1957     9240934    30.332  9.242921e+06  5.545753e+07
2     1962    10267083    31.997  1.026908e+07  6.161446e+07
3     1967    11537966    34.020  1.153997e+07  6.923980e+07
4     1972    13079460    36.088  1.308147e+07  7.848881e+07
...    ...         ...       ...           ...           ...
1699  1987     9216418    62.351  9.218467e+06  5.531080e+07
1700  1992    10704340    60.377  1.070639e+07  6.423835e+07
1701  1997    11404948    46.809  1.140699e+07  6.844195e+07
1702  2002    11926563    39.989  1.192860e+07  7.157163e+07
1703  2007    12311143    43.487  1.231319e+07  7.387916e+07

[1704 rows x 5 columns]

In [31]:
df2.drop?

In [32]:
df2.drop(columns=['total'], inplace=True)

C:\Users\Sibaram Sahu\AppData\Local\Temp\ipykernel_2712\796071089.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop(columns=['total'], inplace=True)

In [33]:
df2

      year  population  life_exp           sum
0     1952     8425333    28.801  8.427314e+06
1     1957     9240934    30.332  9.242921e+06
2     1962    10267083    31.997  1.026908e+07
3     1967    11537966    34.020  1.153997e+07
4     1972    13079460    36.088  1.308147e+07
...    ...         ...       ...           ...
1699  1987     9216418    62.351  9.218467e+06
1700  1992    10704340    60.377  1.070639e+07
1701  1997    11404948    46.809  1.140699e+07
1702  2002    11926563    39.989  1.192860e+07
1703  2007    12311143    43.487  1.231319e+07

[1704 rows x 4 columns]

In [35]:
df2.sort_values(['sum'],ascending=False).head(20)

     year  population  life_exp           sum
299  2007  1318683096  72.96100  1.318685e+09
298  2002  1280400000  72.02800  1.280402e+09
297  1997  1230075000  70.42600  1.230077e+09
296  1992  1164970000  68.69000  1.164972e+09
707  2007  1110396331  64.69800  1.110398e+09
295  1987  1084035000  67.27400  1.084037e+09
706  2002  1034172547  62.87900  1.034175e+09
294  1982  1000281000  65.52500  1.000283e+09
705  1997   959000000  61.76500  9.590021e+08
293  1977   943455000  63.96736  9.434570e+08
704  1992   872000000  60.22300  8.720021e+08
292  1972   862030000  63.11888  8.620320e+08
703  1987   788000000  58.55300  7.880020e+08
291  1967   754550000  58.38112  7.545520e+08
702  1982   708000000  56.59600  7.080020e+08
290  1962   665770000  44.50136  6.657720e+08
289  1957   637408000  50.54896  6.374100e+08
701  1977   634000000  54.20800  6.340020e+08
700  1972   567000000  50.65100  5.670020e+08
288  1952   556263527  44.00000  5.562655e+08

In [61]:
movies = pd.read_csv('../../datasets/movies.csv',index_col=0)
movies.columns

Index(['id', 'budget', 'popularity', 'revenue', 'title', 'vote_average',
       'vote_count', 'director_id', 'year', 'month', 'day'],
      dtype='object')

In [55]:
directors = pd.read_csv('../../datasets/directors.csv', index_col=0)
directors

          director_name    id gender
0         James Cameron  4762   Male
1        Gore Verbinski  4763   Male
2            Sam Mendes  4764   Male
3     Christopher Nolan  4765   Male
4        Andrew Stanton  4766   Male
...                 ...   ...    ...
2344      Shane Carruth  7106   Male
2345   Neill Dela Llana  7107    NaN
2346        Scott Smith  7108    NaN
2347        Daniel Hsia  7109   Male
2348   Brian Herzlinger  7110   Male

[2349 rows x 3 columns]

In [59]:
df1 = directors.merge(movies, left_on="id", right_on="director_id")

In [62]:
df1[['director_name', 'title']]

          director_name                       title
0         James Cameron                      Avatar
1         James Cameron                     Titanic
2         James Cameron  Terminator 2: Judgment Day
3         James Cameron                   True Lies
4         James Cameron                   The Abyss
...                 ...                         ...
1460  Nicole Holofcener                 Enough Said
1461  Nicole Holofcener          Friends with Money
1462  Nicole Holofcener                 Please Give
1463  Nicole Holofcener         Walking and Talking
1464  Nicole Holofcener            Lovely & Amazing

[1465 rows x 2 columns]

In [66]:
df1['director_name'].nunique()

199

In [4]:
df.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [5]:
df.shape

(1704, 6)

In [11]:
len(df.index)

1704

In [14]:
df.sort_values('year', ascending=False)

                country  year  population continent  life_exp        gdp_cap
1703           Zimbabwe  2007    12311143    Africa    43.487     469.709298
491   Equatorial Guinea  2007      551201    Africa    51.579   12154.089750
515            Ethiopia  2007    76511887    Africa    52.947     690.805576
527             Finland  2007     5238460    Europe    79.313   33207.084400
539              France  2007    61083916    Europe    80.657   30470.016700
...                 ...   ...         ...       ...       ...            ...
1116              Niger  1952     3379468    Africa    37.444     761.879376
1128            Nigeria  1952    33119096    Africa    36.324    1077.281856
1140             Norway  1952     3327728    Europe    72.670   10095.421720
1152               Oman  1952      507833      Asia    37.578    1828.230307
852              Kuwait  1952      160000      Asia    55.565  108382.352900

[1704 rows x 6 columns]

In [50]:
df1 = pd.DataFrame({'name': ['Jeff', 'Bill', 'Falguni',], 'gender': ['M', 'M', 'F',], 'income': [ 28000, 25000, 44000]})
df1

      name gender  income
0     Jeff      M   28000
1     Bill      M   25000
2  Falguni      F   44000

In [51]:
df2 = df1['income'].max()
df2

44000

In [64]:
df3 = df1[df1['income']==df2]
df3['name'].item()

'Falguni'

In [65]:
df4 = pd.DataFrame({
    'cust_id': [101, 102,103,104],
    'name': ['rick', 'morty', 'pickle', 'jerry']
})
df4

   cust_id    name
0      101    rick
1      102   morty
2      103  pickle
3      104   jerry

In [67]:
df4.isin([101, 102, 120])

   cust_id   name
0     True  False
1     True  False
2    False  False
3    False  False

In [68]:
df4.isin({'cust_id': [101, 102]})

   cust_id   name
0     True  False
1     True  False
2    False  False
3    False  False

In [73]:
df4.isin(df4.cust_id)

   cust_id   name
0     True  False
1     True  False
2     True  False
3     True  False

In [77]:
df4['name'].nunique()

4

In [78]:
df4

   cust_id    name
0      101    rick
1      102   morty
2      103  pickle
3      104   jerry

In [84]:
df5 = pd.DataFrame({
    'order_id': ['OR1', 'OR3', 'OR23', 'OR42'],
    'cust_id': [102, 105,101,102],
    'amount': [1200, 650, 120, 989]
})
df5

  order_id  cust_id  amount
0      OR1      102    1200
1      OR3      105     650
2     OR23      101     120
3     OR42      102     989

In [82]:
df4

   cust_id    name
0      101    rick
1      102   morty
2      103  pickle
3      104   jerry

In [97]:
df6 = df4.merge(df5, on="cust_id", how="left")
df6

   cust_id    name order_id  amount
0      101    rick     OR23   120.0
1      102   morty      OR1  1200.0
2      102   morty     OR42   989.0
3      103  pickle      NaN     NaN
4      104   jerry      NaN     NaN

In [99]:
df6[df6['name']=='morty']['amount'].sum()

2189.0

In [100]:
pd.merge(df4, df5)

   cust_id   name order_id  amount
0      101   rick     OR23     120
1      102  morty      OR1    1200
2      102  morty     OR42     989

In [103]:
df7 = pd.DataFrame(columns=[
    'Country',
    'Year',
    'Population',
    'Continent'
], data=[['Afghanistan', 1952, 8425333, 'Asia'],['Australia', 1957, 9712569, 'Oceania'],['Brazil', 1962, 76039390, 'Americas'],['China', 1957, 637408000, 'Asia'],['France', 1957, 44310863, 'Europe'],['India', 1952, 3.72e+08, 'Asia'],['United States', 1957, 171984000, 'Americas']])

In [104]:
df7

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
2         Brazil  1962   76039390.0  Americas
3          China  1957  637408000.0      Asia
4         France  1957   44310863.0    Europe
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas

In [105]:
df7_filtered=df7[df7['Population']>= 1000000]

In [108]:
df7_filtered.sort_values(['Year', 'Population'], ascending=[True, False])

         Country  Year   Population Continent
5          India  1952  372000000.0      Asia
0    Afghanistan  1952    8425333.0      Asia
3          China  1957  637408000.0      Asia
6  United States  1957  171984000.0  Americas
4         France  1957   44310863.0    Europe
1      Australia  1957    9712569.0   Oceania
2         Brazil  1962   76039390.0  Americas

In [135]:
df_marks = pd.DataFrame({'dates':["2015-12-06", "2011-12-27", "2015-09-07", "2012-12-21", "2020-02-13"], 'RID':[498, 721, 375, 464, 813], 'Phy':[22, 45, 1, 65, 22], 'Chem':[52, 56, 32, 50, 24], 'Math':[63, 37, 68, 62, 43]})

In [136]:
df_marks

        dates  RID  Phy  Chem  Math
0  2015-12-06  498   22    52    63
1  2011-12-27  721   45    56    37
2  2015-09-07  375    1    32    68
3  2012-12-21  464   65    50    62
4  2020-02-13  813   22    24    43

In [139]:
df_marks_filtered = df_marks[df_marks['dates'] >= '2014-05-01']
df_marks_filtered

        dates  RID  Phy  Chem  Math
0  2015-12-06  498   22    52    63
2  2015-09-07  375    1    32    68
4  2020-02-13  813   22    24    43

In [140]:
df_marks_filtered['avg']=df_marks_filtered[['Phy', 'Chem', 'Math']].mean(axis=1)

C:\Users\Sibaram Sahu\AppData\Local\Temp\ipykernel_73472\3290853985.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_marks_filtered['avg']=df_marks_filtered[['Phy', 'Chem', 'Math']].mean(axis=1)

In [149]:
df_marks_filtered.sort_values(['avg', 'Phy', 'Chem', 'Math'])['RID']

4    813
2    375
0    498
Name: RID, dtype: int64

In [150]:
df_marks

        dates  RID  Phy  Chem  Math
0  2015-12-06  498   22    52    63
1  2011-12-27  721   45    56    37
2  2015-09-07  375    1    32    68
3  2012-12-21  464   65    50    62
4  2020-02-13  813   22    24    43

In [153]:
df1 = pd.DataFrame({'chem_score':[10, 9, 8, 7], 'phy_score':[7, 8, 9, 10], 'Hindi_score':[9, 9, 9, 9]}, index = ['tobey', 'peter', 'chris', 'pratt'])  
df2 = pd.DataFrame({'chem_score':[10, 10, 10, 9], 'maths_score':[6, 6, 7, 9], 'eng_score':[9, 10, 10, 9]}, index = ['chris', 'pratt', 'andrew', 'tom'])

In [154]:
df1

       chem_score  phy_score  Hindi_score
tobey          10          7            9
peter           9          8            9
chris           8          9            9
pratt           7         10            9

In [155]:
df2

        chem_score  maths_score  eng_score
chris           10            6          9
pratt           10            6         10
andrew          10            7         10
tom              9            9          9

In [167]:
(df1['chem_score'].mean() + df2['chem_score'].mean())/2

9.125

In [174]:
(df1.loc['chris', :].sum() + df2.loc['chris', :].sum())/6

8.5

In [179]:
(df1.loc['pratt', :].sum() + df2.loc['pratt', :].sum())/6

8.666666666666666

In [182]:
df1.merge?

In [185]:
len(df1.index)

4

In [187]:
pd.concat([df1,df2])["chem_score"].mean()

9.125

In [190]:
df10 = pd.concat([df1, df2],ignore_index=True,axis=1)

In [191]:
df10.loc["chris"].mean()

8.5

In [192]:
df10.loc["pratt"].mean()

8.666666666666666

In [236]:
def solve(A):
    B = int(A)
    for i in range(B + 1, B + B):
        if (str(i) == str(i)[::-1]):
            return(i)
        
        
print(solve("61423221"))

61433416

In [239]:
def reverse(num):
    reverse= 0
    while num:
        reverse= reverse*10 + num%10
        num= num//10
    return reverse

num= int(input("Enter any number :- "))
while True:
    num+= 1
    if num==reverse(num):
        print ("Next palindrome is : %s"%num)
        break

Enter any number :- 1740948824551711527614232216857618927954312334113874277931986502860248650900613893446066184963788291

KeyboardInterrupt:

In [241]:
temp = "624 657 61 346 815 489 893 807 812 340 663 340 613 66 519 968 105 736 534 621 207 470 309 549 149 674 95 983 656 34 149 280 42 210 625 857 50 869 663 213 560 677 552 172 742 71 139 847 158 25 819 716 494 127 617 994 152 711 976 807 96 477 438 137 38 63 993 439 283 8 651 843 684 203 366 426 625 857 624 134 881 442 849 726 920 465 72 423 527 399 581 622 227 19 111 264 433 455 702 67 814 353 261 498 907 627 275 883 835 250 16 67 43 216 792 314 33 215 736 559 614 668 533 840 686 995 456 470 449 157 537 263 861 149 112 119 775 738 1 609 987 368 27 29 584 171 342 968 385 429 526 350 96 410 190 134 404 997 955 853 153 843 467 366 992 578 484"
x = temp.split(" ")
len(x)

167